posts/a-ramble-about-elisp/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " vocab="http://ogp.me/ns" lang="en">
<head>
<meta charset="utf-8">
<meta name="description" content="A little ramble about elispy  thoughts">
<meta name="viewport" content="width=device-width">
<title>A Ramble About ELisp | Nathan Hughes' blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://sirsharpest.github.io/posts/a-ramble-about-elisp/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Nathan Hughes">
<meta property="og:site_name" content="Nathan Hughes' blog">
<meta property="og:title" content="A Ramble About ELisp">
<meta property="og:url" content="https://sirsharpest.github.io/posts/a-ramble-about-elisp/">
<meta property="og:description" content="A little ramble about elispy  thoughts">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2018-04-10T00:09:40+01:00">
<meta property="article:tag" content="emacs">
<meta property="article:tag" content="programming">
</head>
<body>
    

    <header id="header" class="navbar"><div class="container">
            
    <div class="brand">

        <div class="brand-text">
            <a href="https://sirsharpest.github.io/" title="Nathan Hughes' blog" rel="home">
                Nathan Hughes' blog
            </a>
        </div>

        <a id="btn-toggle-nav" class="navbar-toggle">
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
          <span class="icon-bar"></span>
        </a>
    </div>

            
    <nav class="navbar-collapse collapse"><ul class="nav">
<li><a href="../../archive.html">Archive</a></li>
                <li><a href="../../categories/">Tags</a></li>
                <li><a href="../../rss.xml">RSS feed</a></li>
    
    
    </ul></nav>
</div>
    </header><div class="header-padding"> </div>

    
    <div class="post-header">
        <div class="container">
            <div class="title">
                A Ramble About ELisp
            </div>
        </div>
    </div>

    <div class="post-meta">
      <div class="container">
	<div class="meta clearfix">
	  <div class="authordate">
	    <time class="timeago" datetime="2018-04-10T00:09:40+01:00">2018/04/10</time>
	    

	    
          |  
        <a href="index.org" id="sourcelink">Source</a>

	  </div>
	  <div class="post-tags">
	    <div class="tag">
	      <a href="../../categories/emacs/" rel="tag">emacs</a>
	    </div>
	    <div class="tag">
	      <a href="../../categories/programming/" rel="tag">programming</a>
	    </div>
	  </div>
	</div>
      </div>
    </div>
    
    
    <div id="post-main" class="main">
        <div class="container">
        <div id="outline-container-org82129b5" class="outline-2">
<h2 id="org82129b5">My current language situation</h2>
<div class="outline-text-2" id="text-org82129b5">
<p>
My first programming language was C++, about 11 years ago I picked up the book "C++ for dummies". Like many teenagers I wanted to make my own games and every resource I came across told me that I would need to learn C++. So I did.
</p>

<p>
For about 7 of those years I developed solely in C/C++ only ever using Java, HTML and JavaScript for assignments at college. To me I was a person who only cared about efficiency and therefore all other languages were a distraction from creating smooth and lightweight applications.
</p>

<p>
It was about 3/4 years ago now that I picked up Python as a language, I wanted to scrape websites to get pdf documents which were behind verbose menus and godawful UIs (ahem BlackBoard). I reasoned with myself that Python was a good addition to my kit as it provided a "get it done quickly" tool, I ended up using it more and more. Now all of my work is Python based, all of my analysis is dependant on Python libraries (Matplotlib, Pandas, Scipy etc.).
</p>

<p>
My point of this initial rant is that I created an annoying situation for myself. When presented with a challenge or task I would consider these two options:
</p>

<ol class="org-ol">
<li>Do I want it written quickly? - Use Python</li>
<li>Do I want it to perform efficiently - Use C/C++</li>
</ol>
<p>
As someone who genuinely loves programming and playing with new languages, this became annoying. I could no longer find motivation to learn another language well. There was no benefit to me. Sure there are arguments, but for something to impact my work, my hobbies or my efficiency there was no real contender.
</p>
</div>
</div>

<div id="outline-container-org7cf11ec" class="outline-2">
<h2 id="org7cf11ec">Along comes emacs</h2>
<div class="outline-text-2" id="text-org7cf11ec">
<p>
I'll spare the story about how emacs changed my life and I was saved from a life of cumbersome IDEs. The short of it is, emacs became my editor around the same time I picked up Python.
</p>

<p>
A few months ago however I started to truly love emacs, building an editor to be exactly what I needed and wanted. I changed the way that I thought about the code I was writing. It clicked with me that the code itself was just data and so much of the work is how we think about it and manipulate it.
</p>
</div>
</div>

<div id="outline-container-org1bd215b" class="outline-2">
<h2 id="org1bd215b">elisp</h2>
<div class="outline-text-2" id="text-org1bd215b">
<p>
Emacs isn't a text editor. It's a lisp interpreter, it just happens to be a great editor when you toy with it enough (paraphrasing the old operating system joke there!).
</p>

<p>
Really though, this is true. Emacs has given me something which I was wanting for so long. A solid reason to learn a language which I could incorporate into my daily work routine, something which would make me better at my tasks.
</p>

<p>
A great example (to me) of this is my first elisp function:
</p>

<div class="highlight"><pre><span></span><span class="p">(</span><span class="nf">defun</span> <span class="nv">dear-diary</span> <span class="p">()</span>
  <span class="s">"This function can be used to create an org file with today as it's file name."</span>
  <span class="p">(</span><span class="nf">interactive</span><span class="p">)</span>
  <span class="p">(</span><span class="nf">find-file</span>  <span class="p">(</span><span class="nf">concat</span> <span class="s">"~/Dropbox/Notes/"</span> <span class="p">(</span><span class="nf">format-time-string</span> <span class="s">"%Y-%m-%d.org"</span> <span class="p">))))</span>
</pre></div>

<p>
For anyone unfamiliar with elisp, it simply opens a file with today's date in my dropbox. It's something I use almost everyday to keep track of what I've done and what I need to follow up on with my projects.
</p>

<p>
This code however, is nothing to some of the amazing things that other people create!
</p>

<blockquote class="twitter-tweet" data-lang="en">
<p lang="en" dir="ltr">A bigger bang-for-your-buck demo of CSV transpose <a href="https://t.co/Z3fTYmOhQP">pic.twitter.com/Z3fTYmOhQP</a></p>— emacs gifs (@emacs_gifs) <a href="https://twitter.com/emacs_gifs/status/784248191851954177?ref_src=twsrc%5Etfw">October 7, 2016</a>
</blockquote>
<script async src="https://platform.twitter.com/widgets.js" charset="utf-8"></script><p>
This beautiful example of transposing a CSV file is just one example I came across the other day.
</p>

<p>
Maybe it's simple, but writing code which changes how we code is something that I am endlessly fascinated by.
</p>
</div>
</div>
            
        
        <div id="disqus_thread"></div>
        <script>
        var disqus_shortname ="https-sirsharpest-github-io",
            disqus_url="https://sirsharpest.github.io/posts/a-ramble-about-elisp/",
        disqus_title="A Ramble About ELisp",
        disqus_identifier="cache/posts/a-ramble-about-elisp.html",
        disqus_config = function () {
            this.language = "en";
        };
        (function() {
            var dsq = document.createElement('script'); dsq.async = true;
            dsq.src = 'https://' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script><noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a>
</noscript>
    <a href="https://disqus.com" class="dsq-brlink" rel="nofollow">Comments powered by <span class="logo-disqus">Disqus</span></a>


        
    


        </div>
    </div>

    
    <footer><div class="container">
            <div class="social">



                <div class="social-entry">
                    <a href="../../rss.xml" target="_blank">
                        <i class="fa fa-rss"></i> 
                    </a>
                </div>
            </div>
                <div class="copyright">
                    Contents © 2018         <a href="mailto:nathan1hughes@gmail.com">Nathan Hughes</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
                    
                </div>
           
        </div>
    </footer><script src="../../assets/js/all-nocdn.js" type="text/javascript"></script>
</body>
</html>
